[
  {
    "path": "posts/2021-06-20-dataviz-makeover-2/",
    "title": "DataViz Makeover 2",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Yining Bai",
        "url": {}
      }
    ],
    "date": "2021-06-20",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1). Original Visualization2.1 Critiques:\r\n2.2 Suggestions:\r\n\r\n3).Proposed Design\r\n4).Data visualization steps4.1 Data Preparation\r\n4.2 Create Charts\r\n\r\n5). Final Visualization5.1 Final Dashboard\r\n5.2 Main Observations\r\n\r\n\r\n1). Original Visualization\r\n # 2). Critiques and Suggestions for the Original Visualization\r\n2.1 Critiques:\r\nClarity:\r\nThe axes of the original chart all lacked corresponding currency units. In addition, the currency units are not included in the title, which prevents the reader from getting the correct sense of the size of the number and affects the accuracy and rigor of the chart.\r\nThe original chart uses the size of the bubble to represent the total volume of trade for each country or region. However, by comparing the trading values indicated on the annotation with the bubble size on the graph, we can see that the original author does not use area to compare size, but radius. However, considering that the area of a circle is calculated by squaring the radius, the actual numerical differences will be magnified too much. This form of expression is not accurate, which will give readers wrong cognition of the comparison. China’s trade volume, for example, is about four times as big as Thailand’s, but it is much more than four times bigger on a graph.\r\nThere is a lot more information in the original chart. In addition to the comparison of total trade and imports and exports, the raw chart also shows the balance of trade. The coordinate quadrant of original diagram is divided into two parts using color blocks. For the green part, the export volume of the green part is greater than the import volume of the trade, while the import volume of the blue part is greater than the export volume of the trade. According to the formula for the balance of trade: trade exports minus trade imports, the green part can be defined as net exporters and the blue part as net importers. But this form of presentation is actually confusing to the reader. Whether it is an importer, or an exporter depends on the position of the center of the circle. However, because the circle occupies a large area, it is easy to make the reader mistakenly think that the position of the whole circle determines the positive and negative trade balance.\r\nAesthetics:\r\nThe original chart used different colors to represent different countries. In fact, this color is not necessary if the image contains a text indicating the name of the country. Also, using too many colors will make the focus of the diagram less obvious. In addition, the capacity for all colors is set to 100%, which causes many circles to overlap in occlusion.\r\nThe background color block of the original diagram had nothing to do with the color of the circle, which made the overall design difficult to distinguish between net exporters and net exporters. And it is hard to compare the size of the balance of trade at a glance. The color of the circle should be changed to trade balance related.\r\nThe original diagram is designed with labels, but labels cannot give the reader much detail. Because the original chart contains a lot of information, the Tooltip should be used to provide more detailed country or region related data. The overall graph can only provide a rough comparison for the reader, while the Tooltip should provide a very detailed and intuitive comparison of the data.\r\n2.2 Suggestions:\r\nAdd monetary units “S$” to the axes and titles.\r\nThe size of different bubbles is changed to be defined by area instead of radius.\r\nNo longer use country or region categories for color labelling. Fill the color of Bubble with the value of the trade balance. Use a red to blue gradient color. Red indicates net imports, and darker red indicates greater net imports. Blue represents net exporters, and the darker the blue, the greater the value of exports.\r\nRedesign the tooltips which should contain country/region name, import value, export value, total trade value and balance of trade. Besides that, the rankings of export and import should also be added to help to distinguish the comparisons among different countries or regions.\r\n3).Proposed Design\r\n\r\n4).Data visualization steps\r\n4.1 Data Preparation\r\nData cleaning in the Excel. The data can be downloaded from the DOS web page. We can get the import trading data and export trading data of Singapore with other trading partners. Firstly, we can extract the data of the nine major trading partners: EU, Mainland China, Japan, U.S., Indonesia, Malaysia, Republic of Korea, Thailand, and Taiwan. It is important to note here that the monetary units for these regions are not the same. The monetary unit for EU is million dollars, while others are thousand dollars. For uniform expression, all EU relevant values need to be multiplied by 1,000,000, while other values multiplied by 1,000. We can get the data as following graph shown.\r\n To facilitate subsequent operations, the data should be reorganized. In the new worksheet, new columns “Date”, “Country/Region”, “Import”, and “Export” should be built up. We can use the transpose paste function to copy the selected data in the original sheet and paste them into the new sheet accordingly. Considering the need for data comparison of different years in subsequent analysis, 2 new columns “Import(last)” and “Export(last)” can be added. These two variables represent trade data for the same period of the previous year.\r\n\r\nImport the data into Tableau. Open the Tableau and add the file to the new data source. The finished sheet should be added in.\r\n\r\nChange the date type. The data format of variable “Date” should be changed to date format.\r\n\r\n4.2 Create Charts\r\nBubble chart of merchandise trade performance.\r\nWe can draw a bubble chart to show the overall merchandise performance of the trading partners. 1. Create new calculated fields. Firstly, two new calculated fields should be built through the function “Create new calculated field” under the analysis option. The formula is shown below. This new variable can help us recognize the overall trade volume.\r\n\r\nThen, another new variable “Balance of Trade” can be set up in the same way. Balance of trade if the difference between the value of a country’s imports and exports for a given period. Such index is usually used to measure the relative strength of a country’s economy.\r\n\r\nCreate bubble chart. Drag [Export] and [Import] to the columns and rows panel separately.\r\n\r\nDrag [Country/Region] to the Detail. Drag [Total Trade Value] to the Size. Drag [Balance of Trade] to the Color. Change the marks setting from automatic to circle.  In the color panel, choose the red-blue diverging color and use full color range.\r\n\r\nDrag [Date] to the filter panel and choose years option.\r\n\r\nClick the filter option and choose show filter.\r\n\r\nAxis setting. Right click the axis and edit axis. The range of axis should be fixed and set the fixed start as 0 and fixed end as 75B.\r\n\r\nSet the tooltip. Given the complexity of the information contained in this image, we can set up a more detailed tooltip to help the reader understand it. Here four more new variables can be added to finish tooltips.\r\nIn addition to the numerical comparison of the coordinate axes, we also want to compare the size of import trade volume and export trade volume in a more intuitive way. Ranking variable can be used to realize it. We can create the ranking of import or export according to the formulas shown below.\r\n\r\n\r\nAccording to the definition, if the result of balance of trade is positive, which means export value is higher than import value, such country can be considered as net exporter. Here we create two new variables as shown below to represent.\r\n\r\n\r\nDrag [Net Exporter] [Net Importer] [Ranking by Export] [Ranking by Import] to tooltip.\r\n\r\nClick on the ranking by export and choose to compute using by country/region. The computation of ranking by import can also be modified in the same way.\r\n\r\nThen edit the tooltip content according to the graph shown below.\r\n\r\nAdd reference lines. Right click the y-axis and choose to add reference line. Modify the setting as the graph shown below. Then add the reference line of average export value in the same way.\r\n\r\nTitle setting Set the title as the graph shown below.\r\n\r\nLine chart of balance of trade of major trading partners\r\nWe can draw a line chart to show the changes of balance of trade of different countries or regions from 2011 to 2020. This line chart should be added into the tooltip of the bubble chart we have created before, which can help the readers to understand the trend of balance of trade.\r\nCreate line chart. Drag [Balance of Trade] to the rows panel. Drag [Date] to the columns panel and choose the date format as “years” and “discrete”. Drag [Country/Region] to the filters panel. The graph is shown below.\r\n\r\nThen drag [Balance of Trade] to the color and click on the color panel to choose the colors.\r\n\r\nAxis setting. Right click the axis and edit axis. The range of axis should be fixed and set the fixed start as -25B and fixed end as 35B.\r\n\r\nTitle setting Set the title as the graph shown below.\r\n\r\nAdd the sheet to the tooltip of bubble chart. Modify the tooltip of bubble chart created before according to the graph shown below.\r\n\r\nChart of comparison of import and export values\r\nCreate the chart. Firstly, create measure values including export value and import value.\r\n\r\nDrag the measures values to the columns panel and then drag the variable import to the columns panel as the second measurement. Drag [Country/Region] to the rows panel.\r\n\r\nUnder the marks panel, choose the page of [SUM(Import)]. Change the graph format as gantt bar. Drag [Balance of Trade] to color and size.\r\n\r\nClick on the color option and edit the colors. Here we choose the customized diverging colors. Then set the color steps as 2.\r\n\r\nUnder the marks panel, choose the page of [Measure Values]. Change the graph format as circle. Click on the color option and edit the colors. Here we choose the customized colors. Right click the y-axis and choose to synchronize axis.\r\n\r\nDrag [Date] to the filter panel and choose years option.\r\nClick the filter option and choose show filter. In the filter panel, click the triangle and choose the choice format as single value list.\r\nAxis setting. Right click the axis and edit axis. The range of axis should be fixed and set the fixed start as 0 and fixed end as 75B.\r\n\r\nChange the axis title.\r\n\r\nRight click the axis and edit the format. Change the font size and font color as the graph shown below.\r\n\r\nTitle setting. Set the title as the graph shown below.\r\n\r\nBar Chart of total trade value comparing to the last period\r\nThis chart will show the comparison of total trade value during one specific period and total trade value during the last period. Such chart can reflect the change of total merchandise volume year by year clearly.\r\nCreate new field. Here we need a new variable of total trade value during the last period. Create calculated field is used set up new variable. The formula is shown below.\r\n\r\nCreate the bar chart. Drag [Country/Region] to the columns panel. Drag [Total Trade Value] and [Total Trade(last)] to the rows panel. These two variables should use the same y-axis. Then click on the show me panel and choose the side-by-side bar format.\r\n\r\n\r\nDrag the measure names to color and then click the color panel and choose the customized colors.\r\n\r\nDrag [Date] to the filter panel and choose years option.\r\n\r\nAxis setting. Right click the axis and edit axis. The range of axis should be fixed and set the fixed start as 0 and fixed end as 150B.\r\n\r\nThen change the font size and the color of axis under the format panel.\r\n\r\nTitle setting. Set the title as the graph shown below.\r\n\r\nCreate the dashboard.\r\nChoose the sheet established before and add text notes to finish the dashboard.\r\n5). Final Visualization\r\n5.1 Final Dashboard\r\n\r\n\r\n5.2 Main Observations\r\nOverall situation:\r\nFrom 2011 to 2016, Singapore’s top three import source markets have been Mainland China, Indonesia, and Malaysia. In 2017, the EU surpassed Indonesia to become the third largest source market for Singapore’s imports. Exports from the US to Singapore rose from 2019 to 2020, making it the third largest source market for Singapore’s imports. From 2011 to 2019, Singapore’s top two export markets have been Mainland China and Malaysia. In addition, the United States and the European Union closely follow these two markets, and the difference in exports between the two markets is not significant. In 2020, Taiwan’s import volume to Singapore has increased significantly, making it the third largest export market of Singapore. The following is a detailed analysis of some important trading partners and important time nodes of Singapore.\r\nMainland China:\r\nIn 2013, mainland China overtook Malaysia and became the largest trading partner of Singapore and maintained this position from 2013 to 2020. This can be found through the comparison of Bubble Chart in different years. China’s bubble area has always been the largest since 2013, that is to say, the total trade volume between Singapore and China is the highest among all Singapore’s trading partners. And since 2014, China’s imports and exports to Singapore have consistently ranked first among all its trading partners. That is to say, China’s trade has a significant impact on Singapore’s economy. In addition, China’s trade balance with Singapore has been in surplus since 2011. The lowest point in the decade was in 2018, when China’s trade balance with Singapore stood at S$1,003,882,000.\r\n\r\nUnited States:\r\nFrom 2011 to 2019, the United States has consistently shown a trade balance deficit with Singapore, meaning that the United States imports less from the Singapore market than the United States exports to the Singapore market. That officially changed in 2020, when the U.S. trade balance with Singapore turned into a surplus for the first time in a decade. In fact, according to the trade balance line chart, the balance of trade between the United States and Singapore shows an upward trend, with a large increase from 2014 to 2016. In addition, from 2018 to 2020, US exports to Singapore saw a relatively large increase, and from 2018 to 2019, US imports to Singapore saw a relatively large increase.\r\n\r\nMalaysia:\r\nMalaysia’s trade balance with Singapore has been declining for ten years, and the trade surplus has gradually turned into trade deficit. In 2019, Malaysia’s trade balance with Singapore turned negative for the first time at S$-730,405,000. And it continued to decline in 2020 with the largest decrease in this decade. This phenomenon can be speculated as a result of the economic downturn caused by COVID-19 sweeping the world. Although China has replaced Malaysia as Singapore’s largest trading partner since 2013, the total volume of trade between Malaysia and Singapore remains in the top three of Singapore’s overall trading partners. For geographical and historical reasons, Malaysia still has an important influence on Singapore’s trading economy. The continuous decline of Malaysia’s trade balance also reflects the economic development trend and the change of development focus of Malaysia to a certain extent.\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-20T21:26:36+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-05-30-dataviz-makeover1/",
    "title": "DataViz Makeover1",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Nora Jones",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-05-30",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1). Original Visualization\r\n2). Critiques and Suggestions for the Original Visualization2.1 Critiques:\r\n2.2 Suggestions:\r\n\r\n3).Proposed Design\r\n4).Data visualization steps4.1 Data Preparation\r\n4.2 Create Charts\r\n\r\n5). Final Visualization5.1 Final Dashboard\r\n5.2 Main Observations\r\n\r\n\r\n1). Original Visualization\r\n\r\n2). Critiques and Suggestions for the Original Visualization\r\n2.1 Critiques:\r\nClarity:\r\nIn the same figure, the tick marks of import value and export value are not unified. For example, in the figure Hong Kong, the major tick marks interval of export value is set as 2M, however interval of import value is 200K. Actually, Hong Kong’s exports have always been much higher than its imports. The original graph does not accurately reflect the difference between the number of exports and the number of imports and misleads readers to believe that sometimes the number of imports exceeds the number of exports.\r\nThe tick marks of import value and export value are not unified in different figures. It is difficult for the readers to compare the differences between the imports and exports of different countries from the original graph. In fact, although the top trading countries in the world are selected here, the numbers vary considerably. The original graph gives the false impression that the differences between different countries are not obvious.\r\nThe value range tick marks of axis are not unified in different figures. In some countries, the marks on the X-axis are 2019, 2020, and 2021, while in others, the mark on the X-axis is only 2020. Such graphs seem to indicate that different graphs reflect different periods of time. Meanwhile, the data shown here are for the period 2019-2020, and 2021 is a confusing marker on the X-axis.\r\nThe sort of currency is not marked on the Y-axis. Therefore, readers cannot intuitively feel the size of the amount.\r\nThe title on the X-axis is not accurate. The title is“Month of period”, but the pick mark is the year, which confuses the reader. In fact, the title here is not necessary.\r\nThe source of the data is not identified at the bottom of the image, which is not standard. In addition, some special notes about the content of the data should also be added below the chart.\r\nAesthetics:\r\nShading is added under lines in the original graph. In order to compare the difference between the imports and exports, the shading colors are set to translucent. But this design resulted in a third color where the import part and export part overlapped. The final presentation makes it difficult for the readers to distinguish between different areas. Shading is not necessary here.\r\nThe widths of different graphs are not uniform. Such drawing is not standard. At the same time, different sizes may make readers confuse the length of time period for data analysis, and it is not conducive to comparing differences among different countries.\r\nMost of the broken lines are closer to the upper limit. Such design looks not comfortable and beautiful. It would be better if the lines are concentrated in the middle of the picture as much as possible.\r\n2.2 Suggestions:\r\nRemove the scale line on the right side, and the lines of exports and imports can be all drawn with reference to the scale line on the left side.\r\nUnify the range of values and scale lines in all the graphs.\r\nAfter rearranging the data, the six countries were plotted together, sharing the same X-axis and scale lines.\r\nAdd the currency type name at the end of the picture title.\r\nHide the X-axis title.\r\nAdd text description of data source and value range in dashboards.\r\nThe shading part is removed from the broken line diagram, and only the line segment part is retained.\r\nAdjust the maximum value of Y axis and scale line to ensure that most of the broken line chart is located in the center of the screen.\r\n3).Proposed Design\r\n\r\n\r\n4).Data visualization steps\r\n4.1 Data Preparation\r\n1. Remove unnecessary data. The original data contains a lot of data and information that we do not need, which can be removed altogether. Data for only these six countries, from January 2019 to December 2020, need to be retained. \r\n2. Rearrange the variables and columns. In order to import the data into Tableau for manipulation, the data needs to be rearranged and the corresponding variables need to be set.\r\n\r\n3. Import the date into Tableau. The excel sheet is imported into Tableau.\r\n\r\n4. Change the data type. Change the data type of time from string type to date type.\r\n\r\n5. Create a new calculated field. In the comparison of trade volume, the balance of trade is a very important index which is often used to measure whether the trade and economic development of a country is healthy and stable. Here, we can use the formula to create a new variable based on the known import and export figures. The function “Create Calculated Field” under the analysis menu is used.\r\n\r\n\r\n4.2 Create Charts\r\nLine Chart of Merchandise Trading of 6 countries\r\nCreate line chart. Set the columns and rows as the graph shown.\r\n\r\n\r\nSet the colors of import value and export value.\r\n\r\nSet the scales and the range value of the Y-axis. Here the range is set as fixed, and the maximum value is 10M.\r\n\r\nChange the title of the sheet as shown in the image, and select the appropriate color, font, and size. Also add the name of the currency type at the end.\r\n\r\nLine Chart of Export/Import Trade per quarter\r\nCreate line chart. Set the columns and rows as the graph shown. This graph This graph shows quarterly changes, therefore the date should be set and retained as quarter form.\r\n\r\nSet the color of the country lines as the graph shown.\r\n\r\nSet the scales and the range value of the Y-axis. Here the range is set as fixed, and the maximum value is 25M.\r\nChange the title of the sheet as shown in the image, and select the appropriate color, font, and size. Also add the name of the currency type at the end. \r\nThen the line chart of import trade can be drawn with same steps.\r\nBar Chart of Export/Import Trade per Year\r\nCreate bar chart.Set the columns and rows as the graph shown. Drag the country to the color mark and then set each country’s color accordingly. \r\nSet the scales and the range value of the Y-axis. Here the range is set as fixed, and the maximum value is 70M.\r\nClick on the label in Marks menu and then select “Show mark labels”. Then specific statistics are added to the bar chart. After that, the text direction can be adjusted under the alignment menu.\r\n\r\nAdd annotation of the rate of change from 2019 to 2020 on the bar chart. Set the color of the annotation according to the positive or negative of the number. \r\nChange the title of the sheet as shown in the image, and select the appropriate color, font, and size. Also add the name of the currency type at the end.\r\nThen the bar chart of import trade can be drawn with same steps.\r\nBar Chart of Balance of Trade\r\nCreate the bar chart and set the columns and rows as the graph shown. Here the created calculated field “Balance of Trade” created earlier is used. This graph shows the change of balance of trade of these six countries from 2019 to 2020. \r\nSet the scales and the range value of the Y-axis. The maximum value is set as 60M and the minimum value is set as -20M.\r\nDrag the [SUM(Balance of Trade)] to the color mark and set the color according to the positive or negative of the number. Set the color steps as 2 and set the center value as 0. \r\nClick on the label in Marks menu and then select “Show mark labels”. Adjust the text direction as before and select “Match Mark Color”. Then the mark labels’ color is same as the bar. \r\nAdd annotation of the rate of change from 2019 to 2020 on the bar chart. Set the color of the annotation according to the positive or negative of the number.\r\nChange the title of the sheet as shown in the image, and select the appropriate color, font, and size. Also add the name of the currency type at the end.\r\nCreate the dashboard.\r\nChoose the sheet established before and add text notes to finish the dashboard.\r\n5). Final Visualization\r\n5.1 Final Dashboard\r\n\r\n5.2 Main Observations\r\nAccording to the balance of trade calculation, Hong Kong has been in a trade surplus for a long time, with exports much higher than imports. The trade surplus is the largest among the six countries. From 2019 to 2020, Hong Kong’s trade surplus still increased slightly.\r\nExcept Malaysia, the total export trade of the remaining five countries increased from 2019 to 2020. Malaysia’s exports fell by about 18% from 2019. In addition, Malaysia’s trade balance declined by the most among the six countries from 2019 to 2020, with a total decrease of 1500%, showing a relatively serious trade deficit. As a result, Malaysia’s trade economy has become unbalanced, which the government needs to pay attention to.\r\nThe United States has the largest increase in its trade balance from 2019 to 2020, with a 139% increase, and moved from a trade deficit to a trade surplus in 2019. As a result, the health of the US trade economy improved from 2019 to 2020. At the same time, total US exports rose from 2019 to 2020, while total imports declined. Hence the decline in American foreign demand.\r\nTaken as a whole, the total value of imports and exports in the six countries did not change very sharply in the eight quarters of the two years. Among them, from 2019 Q4 to 2020 Q2, the total export volume of China and Malaysia showed a relatively large decline and picked up from 2020 Q2 to 2020 Q3. Imports rose in almost six countries in March 2019 and then fell in the following quarter. This situation can be considered to be caused by the impact of the holiday at the end of the year and the beginning of the year.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-30T21:54:47+08:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to My Blog",
    "description": "Welcome to our new blog, My Blog. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Nora Jones",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-05-30",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-30T21:36:16+08:00",
    "input_file": {}
  }
]
