[
  {
    "path": "posts/2021-06-20-dataviz-makeover-2/",
    "title": "DataViz Makeover 2",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Nora Jones",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-06-20",
    "categories": [],
    "contents": "\r\nDistill is a publication format for scientific and technical writing, native to the web.\r\nLearn more about using Distill at https://rstudio.github.io/distill.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-20T17:32:54+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-05-30-dataviz-makeover1/",
    "title": "DataViz Makeover1",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Nora Jones",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-05-30",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1). Original Visualization\r\n2). Critiques and Suggestions for the Original Visualization2.1 Critiques:\r\n2.2 Suggestions:\r\n\r\n3).Proposed Design\r\n4).Data visualization steps4.1 Data Preparation\r\n4.2 Create Charts\r\n\r\n5). Final Visualization5.1 Final Dashboard\r\n5.2 Main Observations\r\n\r\n\r\n1). Original Visualization\r\n\r\n2). Critiques and Suggestions for the Original Visualization\r\n2.1 Critiques:\r\nClarity:\r\nIn the same figure, the tick marks of import value and export value are not unified. For example, in the figure Hong Kong, the major tick marks interval of export value is set as 2M, however interval of import value is 200K. Actually, Hong Kong’s exports have always been much higher than its imports. The original graph does not accurately reflect the difference between the number of exports and the number of imports and misleads readers to believe that sometimes the number of imports exceeds the number of exports.\r\nThe tick marks of import value and export value are not unified in different figures. It is difficult for the readers to compare the differences between the imports and exports of different countries from the original graph. In fact, although the top trading countries in the world are selected here, the numbers vary considerably. The original graph gives the false impression that the differences between different countries are not obvious.\r\nThe value range tick marks of axis are not unified in different figures. In some countries, the marks on the X-axis are 2019, 2020, and 2021, while in others, the mark on the X-axis is only 2020. Such graphs seem to indicate that different graphs reflect different periods of time. Meanwhile, the data shown here are for the period 2019-2020, and 2021 is a confusing marker on the X-axis.\r\nThe sort of currency is not marked on the Y-axis. Therefore, readers cannot intuitively feel the size of the amount.\r\nThe title on the X-axis is not accurate. The title is“Month of period”, but the pick mark is the year, which confuses the reader. In fact, the title here is not necessary.\r\nThe source of the data is not identified at the bottom of the image, which is not standard. In addition, some special notes about the content of the data should also be added below the chart.\r\nAesthetics:\r\nShading is added under lines in the original graph. In order to compare the difference between the imports and exports, the shading colors are set to translucent. But this design resulted in a third color where the import part and export part overlapped. The final presentation makes it difficult for the readers to distinguish between different areas. Shading is not necessary here.\r\nThe widths of different graphs are not uniform. Such drawing is not standard. At the same time, different sizes may make readers confuse the length of time period for data analysis, and it is not conducive to comparing differences among different countries.\r\nMost of the broken lines are closer to the upper limit. Such design looks not comfortable and beautiful. It would be better if the lines are concentrated in the middle of the picture as much as possible.\r\n2.2 Suggestions:\r\nRemove the scale line on the right side, and the lines of exports and imports can be all drawn with reference to the scale line on the left side.\r\nUnify the range of values and scale lines in all the graphs.\r\nAfter rearranging the data, the six countries were plotted together, sharing the same X-axis and scale lines.\r\nAdd the currency type name at the end of the picture title.\r\nHide the X-axis title.\r\nAdd text description of data source and value range in dashboards.\r\nThe shading part is removed from the broken line diagram, and only the line segment part is retained.\r\nAdjust the maximum value of Y axis and scale line to ensure that most of the broken line chart is located in the center of the screen.\r\n3).Proposed Design\r\n\r\n\r\n4).Data visualization steps\r\n4.1 Data Preparation\r\n1. Remove unnecessary data. The original data contains a lot of data and information that we do not need, which can be removed altogether. Data for only these six countries, from January 2019 to December 2020, need to be retained. \r\n2. Rearrange the variables and columns. In order to import the data into Tableau for manipulation, the data needs to be rearranged and the corresponding variables need to be set.\r\n\r\n3. Import the date into Tableau. The excel sheet is imported into Tableau.\r\n\r\n4. Change the data type. Change the data type of time from string type to date type.\r\n\r\n5. Create a new calculated field. In the comparison of trade volume, the balance of trade is a very important index which is often used to measure whether the trade and economic development of a country is healthy and stable. Here, we can use the formula to create a new variable based on the known import and export figures. The function “Create Calculated Field” under the analysis menu is used.\r\n\r\n\r\n4.2 Create Charts\r\nLine Chart of Merchandise Trading of 6 countries\r\nCreate line chart. Set the columns and rows as the graph shown.\r\n\r\n\r\nSet the colors of import value and export value.\r\n\r\nSet the scales and the range value of the Y-axis. Here the range is set as fixed, and the maximum value is 10M.\r\n\r\nChange the title of the sheet as shown in the image, and select the appropriate color, font, and size. Also add the name of the currency type at the end.\r\n\r\nLine Chart of Export/Import Trade per quarter\r\nCreate line chart. Set the columns and rows as the graph shown. This graph This graph shows quarterly changes, therefore the date should be set and retained as quarter form.\r\n\r\nSet the color of the country lines as the graph shown.\r\n\r\nSet the scales and the range value of the Y-axis. Here the range is set as fixed, and the maximum value is 25M.\r\nChange the title of the sheet as shown in the image, and select the appropriate color, font, and size. Also add the name of the currency type at the end. \r\nThen the line chart of import trade can be drawn with same steps.\r\nBar Chart of Export/Import Trade per Year\r\nCreate bar chart.Set the columns and rows as the graph shown. Drag the country to the color mark and then set each country’s color accordingly. \r\nSet the scales and the range value of the Y-axis. Here the range is set as fixed, and the maximum value is 70M.\r\nClick on the label in Marks menu and then select “Show mark labels”. Then specific statistics are added to the bar chart. After that, the text direction can be adjusted under the alignment menu.\r\n\r\nAdd annotation of the rate of change from 2019 to 2020 on the bar chart. Set the color of the annotation according to the positive or negative of the number. \r\nChange the title of the sheet as shown in the image, and select the appropriate color, font, and size. Also add the name of the currency type at the end.\r\nThen the bar chart of import trade can be drawn with same steps.\r\nBar Chart of Balance of Trade\r\nCreate the bar chart and set the columns and rows as the graph shown. Here the created calculated field “Balance of Trade” created earlier is used. This graph shows the change of balance of trade of these six countries from 2019 to 2020. \r\nSet the scales and the range value of the Y-axis. The maximum value is set as 60M and the minimum value is set as -20M.\r\nDrag the [SUM(Balance of Trade)] to the color mark and set the color according to the positive or negative of the number. Set the color steps as 2 and set the center value as 0. \r\nClick on the label in Marks menu and then select “Show mark labels”. Adjust the text direction as before and select “Match Mark Color”. Then the mark labels’ color is same as the bar. \r\nAdd annotation of the rate of change from 2019 to 2020 on the bar chart. Set the color of the annotation according to the positive or negative of the number.\r\nChange the title of the sheet as shown in the image, and select the appropriate color, font, and size. Also add the name of the currency type at the end.\r\nCreate the dashboard.\r\nChoose the sheet established before and add text notes to finish the dashboard.\r\n5). Final Visualization\r\n5.1 Final Dashboard\r\n\r\n5.2 Main Observations\r\nAccording to the balance of trade calculation, Hong Kong has been in a trade surplus for a long time, with exports much higher than imports. The trade surplus is the largest among the six countries. From 2019 to 2020, Hong Kong’s trade surplus still increased slightly.\r\nExcept Malaysia, the total export trade of the remaining five countries increased from 2019 to 2020. Malaysia’s exports fell by about 18% from 2019. In addition, Malaysia’s trade balance declined by the most among the six countries from 2019 to 2020, with a total decrease of 1500%, showing a relatively serious trade deficit. As a result, Malaysia’s trade economy has become unbalanced, which the government needs to pay attention to.\r\nThe United States has the largest increase in its trade balance from 2019 to 2020, with a 139% increase, and moved from a trade deficit to a trade surplus in 2019. As a result, the health of the US trade economy improved from 2019 to 2020. At the same time, total US exports rose from 2019 to 2020, while total imports declined. Hence the decline in American foreign demand.\r\nTaken as a whole, the total value of imports and exports in the six countries did not change very sharply in the eight quarters of the two years. Among them, from 2019 Q4 to 2020 Q2, the total export volume of China and Malaysia showed a relatively large decline and picked up from 2020 Q2 to 2020 Q3. Imports rose in almost six countries in March 2019 and then fell in the following quarter. This situation can be considered to be caused by the impact of the holiday at the end of the year and the beginning of the year.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-30T21:54:47+08:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to My Blog",
    "description": "Welcome to our new blog, My Blog. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Nora Jones",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-05-30",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-30T21:36:16+08:00",
    "input_file": {}
  }
]
